{"projects":[{
"id":0,
"title":"ReFrame: Layer Caching for Accelerated Inference in Real-Time Rendering",
"description":"Published to ICML 2025, we accelerate real-time rendering workloads by introducing approximate layer caching.",
"shortdesc":"A technique to reuse intermediate features in rendering networks.",
"image":"./images/icml.jpg",
"tags":["Software","Research","ML"],
"skills":["PyTorch","CUDA"],
"link":"https://ubc-aamodt-group.github.io/reframe-layer-caching/",
"year":"2025"},
{
"id":1,
"title":"TTA: Generalized Ray Tracing Accelerator",
"description":"Published to MICRO 2024, we show how a ray tracing accelerator can be easily extended to accelerate general tree traversal applications.",
"shortdesc":"A general-purpose tree-traversal accelerator based on ray tracing.",
"image":"./images/tta.jpg",
"tags":["Simulation","Hardware","Research"],
"skills":["C++","CUDA","Vulkan","GPGPU-Sim","Verilog"],
"link":"./projects/micro2024.html",
"year":"2024"},
{
"id":2,
"title":"LumiBench",
"description":"Published to IISWC 2023, LumiBench is the first benchmark suite for evaluating ray tracing hardware performance in modern GPUs designed to execute on the Vulkan-Sim GPU simulator.",
"shortdesc":"A benchmark suite for ray tracing research",
"image":"./images/lumibench-project.jpeg",
"tags":["Simulation","Research"],
"skills":["C++","Vulkan","GPGPU-Sim","Python"],
"link":"./projects/iiswc2023.html",
"year":"2023"},
{
"id":3,
"title":"Vulkan-Sim",
"description":"Published to MICRO 2022, Vulkan-Sim fills the gap in architectural ray tracing simulation. We extend GPGPU-Sim, integrating with Mesa, to support the Vulkan API and simulate cycle-level execution of ray tracing workloads on modern GPUs.",
"shortdesc":"A cycle-level simulator for Vulkan ray tracing applications.",
"image":"./images/MICRO22.png",
"tags":["Simulation","Hardware","Research"],
"skills":["C++","Vulkan","GPGPU-Sim","Python"],
"link":"https://github.com/ubc-aamodt-group/vulkan-sim",
"year":"2022"},
{
"id":4,
"title":"Ray Intersection Predictor",
"description":"Published to MICRO 2021, we propose a ray intersection predictor that speculatively elides redundant operations during ray traversal in ray-traced ambient occlusion workloads. On a mobile class GPU with a ray tracing accelerator unit, we find the addition of a 5.5KB predictor per SM improves performance by a geometric mean of 26%.",
"shortdesc":"A hardware predictor module designed to accelerate ray tracing on GPUs.",
"image":"./images/MICRO.JPG",
"tags":["Simulation","Hardware","Research"],
"skills":["C++","CUDA","GPGPU-Sim","GPUWattch","CACTI7"],
"link":"./projects/micro2021.html",
"year":"2021"},
{
"id":5,
"title":"JPEG-ACT",
"description":"Published to ISCA 2020, we show how JPEG compresion for activations in convolutional neural networks can achieve 2.4x higher training performance while consuming less than 1% overhead in power and area of a modern GPU. In this work, I helped model the hardware unit to estimate costs. ",
"shortdesc":"A JPEG compression method for activation storage in convolutional neural network training.",
"image":"./images/ISCA.JPG",
"tags":["Hardware","Research"],
"skills":["C++","Verilog"],
"link":"https://people.ece.ubc.ca/aamodt/papers/evans.isca2020.pdf",
"year":"2020"},
{
"id":6,
"title":"Electric Shock Risk Assessment",
"description":"Krypton is a web-based tool designed to mimic the existing Argon software but modified to support criteria from BC Hydro. This tool uses IEEE standards to assess the probability of ventricular fibrillation near a high-voltage transmission line when a ground fault occurs. ",
"shortdesc":"A web-based tool to assess probability of ventricular fibrillation near a high-voltage ground fault. ",
"image":"./images/krypton.JPG",
"tags":["Simulation","Software"],
"skills":["JavaScript","HTML","Circuits","MATLAB"],
"link":"./krypton/krypton.html",
"year":"2020"},
{
"id":7,
"title":"Netflix Wrapped",
"description":"Neflix Wrapped helps visualize personal Netflix data, showing the viewing activity for the year. This project is built in Observable and is inspired by the popular Spotify Wrapped.",
"shortdesc":"A visualization of your Netflix data showing viewing activity for the year. ",
"image":"./images/netflix-wrapped.JPG",
"tags":["Software"],
"skills":["JavaScript","CSS","HTML","Observable"],
"link":"./netflix-wrapped/index.html",
"year":"2021"},
{
"id":8,
"title":"VLSI Router",
"description":"Completed for the CPEN 513 course, this project features a basic maze router implemented using the Lee-Moore and A* algorithms to perform detailed routing from source pins to multiple sink pins without overlap. The algorithm is visualized in an interactive GUI.",
"shortdesc":"A basic maze router implemented using the Lee-Moore and A* algorithms to perform detailed routing from source pins to multiple sink pins without overlap.",
"image":"./images/assn1.JPG",
"tags":["Hardware","Simulation"],
"skills":["Python","CAD","Tkinter"],
"link":"https://github.com/lucylufei/CPEN513-assn1",
"year":"2021"},
{
"id":9,
"title":"VLSI Placement",
"description":"Completed for the CPEN 513 course, this project features an implementation of tuned Simulated Annealing to minimize cost function for VLSI chip placement. The algorithm is visualized in an interactive GUI.",
"shortdesc":"An implementation of tuned Simulated Annealing to minimize cost function for VLSI chip placement.",
"image":"./images/assn2.JPG",
"tags":["Hardware","Simulation"],
"skills":["Python","CAD","Tkinter"],
"link":"https://github.com/lucylufei/CPEN513-assn2",
"year":"2021"},
{
"id":10,
"title":"VLSI Partitioner",
"description":"Completed for the CPEN 513 course, this project features an implementation of Branch and Bound algorithm used to partition graph nodes for minimized cut size in VLSI chip placement. The algorithm is visualized in an interactive GUI.",
"shortdesc":"An implementation of Branch and Bound algorithm used to partition graph nodes for minimized cut size in VLSI chip placement. ",
"image":"./images/assn3.JPG",
"tags":["Hardware","Simulation"],
"skills":["Python","CAD","Tkinter"],
"link":"https://github.com/lucylufei/CPEN513-assn3",
"year":"2021"},
{
"id":11,
"title":"VLSI Genetics Algorithm",
"description":"Completed for the CPEN 513 course, this project features an implementation of the genetics algorithm for VLSI partitioning and placement in the FPGA CAD flow. The algorithm is visualized in an interactive GUI.",
"shortdesc":"An implementation of the genetics algorithm for VLSI partitioning and placement in the FPGA CAD flow. ",
"image":"./images/genetics.JPG",
"tags":["Hardware","Simulation"],
"skills":["Python","CAD","Tkinter"],
"link":"https://github.com/lucylufei/CPEN513-FinalProject",
"year":"2021"},
{
"id":12,
"title":"Telenotes",
"description":"Telenotes is a Google Chrome extension for adding notes to videos at specific timestamps. Notes can be saved, exported, shared, and reloaded, such that other users can also receive notes at the correct timestamp. ",
"shortdesc":"A Google Chrome extension for adding notes to videos at specific timestamps. ",
"image":"./images/telenotes1.png",
"tags":["Software"],
"skills":["JavaScript","CSS","HTML"],
"link":"./projects/telenotes.html",
"year":"2020"},
{
"id":13,
"title":"Hood Hunter",
"description":"Designed as part of the CPSC 547 course, this visualization tool helps support prospective home buyers in selecting neighbourhoods. The tool features a price filter, map view, and neighbourhood rankings in several factors. ",
"shortdesc":"An explorer visualization tool to support prospective home buyers in selecting neighbourhoods.",
"image":"./images/teaser-hood-hunter.PNG",
"tags":["Software"],
"skills":["JavaScript","Python","CSS","HTML"],
"link":"./projects/hoodhunter.html",
"year":"2021"},
{
"id":14,
"title":"Clock",
"description":"This is a fun and simple JavaScript clock displaying time to the nearest 5 minutes using an array of words and phrases.",
"shortdesc":"A simple JavaScript clock displaying time to the nearest 5 minutes using an array of words and phrases.",
"image":"./images/clock.JPG",
"tags":["Software"],
"skills":["JavaScript","CSS","HTML"],
"link":"./clock.html",
"year":"2019"},
{
"id":15,
"title":"Magnetic Tracking Rover",
"description":"In completion of ELEC 291, we build a rover from a blank breadboard, wheels, and sheet metal to track a preprogrammed wire generating a magnetic field detected by inductors. The wire can be user-controlled for real time signals, tracked by the rover to complete commands such as 180 turns.",
"shortdesc":"A rover built from a blank breadboard, wheels, and sheet metal to track a preprogrammed wire generating a magnetic field detected by inductors. ",
"image":"./images/rover.JPG",
"tags":["Hardware"],
"skills":["Electromagnetics","Circuits"],
"link":"./projects/magnetic-rover.html",
"year":"2018"},
{
"id":16,
"title":"Laser Light Show",
"description":"In completion of ELEC 391, we build a system featuring two self designed DC brush motors, controlled with PID controller in Arduino interface to generate shapes and designs using laser light. The laser has two degrees of freedom to draw any shape inputted by an user through a self-designed GUI.",
"shortdesc":"A system featuring two self-designed DC brush motors, controlled with PID controller in Arduino interface to generate shapes and designs using laser light. ",
"image":"./images/laser.JPG",
"tags":["Hardware","Software","Simulation"],
"skills":["Circuits","Arduino","MATLAB","Altium"],
"link":"./projects/laser-show.html",
"year":"2019"},
{
"id":17,
"title":"3D Printer Simulation",
"description":"As part of ELEC 341, we simulate a 3D laser sintering printer first modeled in Simulink as a block diagram. Then, a PID controller is designed in accordance to root locus and Nyquist criteria to achieve minimal accumulated position error while printing.",
"shortdesc":"A simulation of a 3D laser sintering printer modeled in Simulink with custom-tuned PID controller.",
"image":"./images/printer.JPG",
"tags":["Simulation"],
"skills":["MATLAB","Simulink","PIDControl"],
"link":"./files/341.pdf",
"year":"2018"}]}