{"projects":[{
"id":0,
"title":"Magnetic Tracking Rover",
"description":"A rover is built from a blank breadboard, wheels, and sheet metal to track a preprogrammed wire generating a magnetic field detected by inductors. The wire can be user-controlled for real time signals, tracked by the rover to complete commands such as 180 turns.",
"image":"/images/rover.JPG",
"tags":["Hardware"],
"skills":["Electromagnetics","Circuits"],
"link":""},
{
"id":1,
"title":"Laser Light Show",
"description":"A system featuring two self designed DC brush motors, controlled with PID controller in Arduino interface to generate shapes and designs using laser light. The laser has two degrees of freedom to draw any shape inputted by an user through a self-designed GUI",
"image":"/images/laser.JPG",
"tags":["Hardware","Software","Simulation"],
"skills":["Circuits","Arduino","MATLAB","Altium"],
"link":""},
{
"id":2,
"title":"Electric Shock Risk Assessment",
"description":"A web-based tool based on existing Argon software and IEEE standards to assess probability of ventricular fibrillation near a high voltage transmission line if a ground fault occurs. ",
"image":"/images/krypton.JPG",
"tags":["Simulation"],
"skills":["JavaScript","HTML","Circuits","MATLAB"],
"link":"/krypton/form.html"},
{
"id":3,
"title":"Clock",
"description":"Simple JavaScript clock displaying time to the nearest 5 minutes using an array of words and phrases.",
"image":"/images/jsclock.JPEG",
"tags":[""],
"skills":["JavaScript"," CSS"," HTML"],
"link":"/clock.html"},
{
"id":4,
"title":"Pong",
"description":"The classic Pong game, written in SystemVerilog to be displayed through VGA and controlled by player on FPGA. The game features intelligent demo mode as well as bot player mode with an extra challenging \"Kraken\" mode where a monster can be invoked.",
"image":"/images/pong.JPG",
"tags":["Hardware"],
"skills":["Verilog","FPGA"],
"link":""},
{
"id":5,
"title":"ARC4 Decryption Circuit",
"description":"Simplified ARC4 decryption circuit in Verilog, implemented on an FPGA. Utilizes multiple modules to simultaneously search for a 6 digit hexidecimal \"key\" and decipher ASCII messages. Operates following a ready-enable protocol.",
"image":"/images/DecipheredMessage.JPG",
"tags":["Hardware"],
"skills":["Verilog","FPGA"],
"link":""},
{
"id":6,
"title":"Simple RISC Machine",
"description":"A turing complete RISC machine created through Verilog code and synthesized in Quartus, capable of reading binary instructions. Implemented on a FPGA, successfully executing Fibonacci sequence code written in C with top 10 execution time of 100+ groups.",
"image":"/images/risc.JPG",
"tags":["Hardware"],
"skills":["Verilog","FPGA"],
"link":""},
{
"id":7,
"title":"3D Printer Simulation",
"description":"Simulation of a 3D laser sintering printer first modeled in Simulink as a block diagram. Then, a PID controller is designed in accordance to root locus and Nyquist criteria to achieve minimal accumulated position error while printing.",
"image":"/images/printer.JPG",
"tags":["Simulation"],
"skills":["MATLAB","Simulink","PID Control"],
"link":""},
{
"id":8,
"title":"Mechanical Claw",
"description":"The mechanical claw was built using sheet metal, wires, and a motor controlled using an Arduino microprocessor. The claw is automated and closes around the object it is attempting to pick up when it senses the floor.",
"image":"/images/2.JPG",
"tags":["Hardware","Simulation"],
"skills":["SolidWorks","Arduino"],
"link":""},
{
"id":9,
"title":"Graphics Accelerator",
"description":"Accelerators written in SystemVerilog to improve speeds of VGA display and matrix multiplications used in image transformations and distortions.",
"image":"/images/whiskytiny.JPG",
"tags":["Hardware"],
"skills":["Verilog","FPGA"],
"link":""},
{
"id":10,
"title":"ATMEL Microprocessor Projects",
"description":"Various projects were completed using 8051 assembly on a breadboard with an ATMEL microprocessor. This includes a thermometer, a RMS/peak voltage calculator, a motor controller, and more.",
"image":"/images/IMG_1236.JPG",
"tags":["Hardware"],
"skills":["Assembly","Microprocessor","Circuits"],
"link":""},
{
"id":11,
"title":"Tic Tac Toe Game",
"description":"My first project using Verilog involved the creation of a tic-tac-toe game in which the computer never loses. The code was tested on ModelSim and synthesized on Quartus. It was then implemented on a SoC and displayed through VGA to be user interactive.",
"image":"/images/IMG_1237.JPG",
"tags":["Hardware"],
"skills":["Verilog","FPGA"],
"link":""},
{
"id":12,
"title":"Solder Oven Controller",
"description":"Using 8051 assembly with an ATMEL microprocessor, our team built a responsive controller that could connect and control a toaster oven for the purpose of soldering. A BJT tracks the temperature of the oven and controls the PWM power to cycle through 5 phases of a finite state machine.",
"image":"/images/IMG_1238.JPG",
"tags":["Hardware"],
"skills":["Circuits","Arduino","Assembly"],
"link":""},
{
"id":13,
"title":"Rain Harvesting Analysis",
"description":"A small town on Texada Island, BC wishes to rely on rain water throughout the year. Excel calculations are used to determine the best choices in piping, tank, pipes, etc, to harvest water to maintain the water consumption lifestyle of Texada citizens without BC Hydro.",
"image":"/images/IMG_1235.JPG",
"tags":["Simulation"],
"skills":["Excel","MATLAB"],
"link":""},
{
"id":14,
"title":"Marketing Plan",
"description":"A marketing plan developed for Rent the Runway through investigation of the company's core competencies, consumer preferences, competition and partners. Ideas were generated using SWOT analysis and with customer segmentation in mind.",
"image":"/images/rtr.JPG",
"tags":[""],
"skills":["Marketing","SWOT Analysis"],
"link":""}]}